{
    "translation": {
        "Sobre min": "About me",
        "Home": "Home",
        "api": " Projects API(learning through Integrated projects)",
        "Outrosprojetos": "Other Projects",
        "meusRepositorios": "My Repositories",
        "Projetos": "Projects",
        "Contate-me": "Contact me",
        "bemvindo": "Welcome!, I am",
        "algoincrivel": "Let's do something amazing together!",
        "currículo": "Curriculum",
        "atualmente": "Currently working as",
        "desenvolvedor": "Software developer",
        "em": "in",
        "produzido": "Created by",
        "sobretexto1": "I am currently studying the 6th semester of Multiplatform Software Development at the renowned Faculty of Technology of the State of São Paulo (Fatec) Prof. Jessen Vidal. I am passionate about collaborative work environments, where I can effectively contribute to teams focused on developing new projects or optimizing existing systems. I am a motivated student, always seeking improvement and continuous learning. My main goal is to create robust technological solutions that add significant value.",
        "sobretexto2": "I have technical skills in various programming languages, including Java, JavaScript, Python, and TypeScript, as well as academic experiences in frameworks such as Spring, React, Vue, FastAPI, and Node. I have practical experience in full-stack development, using React for frontend construction and implementing REST APIs for the backend. Additionally, I have knowledge in database management, with experience in MySQL.",
        "habilidades": "Skills",
        "expyear": "year of experience",
        "expyears": "years of experience",
        "api-1-title": "FATEC São José dos Campos Priority Information Disclosure System 1° Semester of 2021",
        "api-1-description": "Due to the high volume of information exchanged via email, as a result of the COVID-19 pandemic, many important pieces of information started to be received/read outside of their appropriate time. Given this scenario, it is necessary to develop an application capable of selectively and controlledly disseminating general or specific notices from Fatec courses to teachers or students.",
        "fechar": "Close",
        "detalhes": "View Details",
        "Ver": "View on",
        "api-2-title": "Talent Management System for Human Resources and Personnel Department 2° Semester of 2022",
        "api-2-description": "My objective was to support the Human Resources and Personnel Department in developing a platform designed to efficiently manage all of the company's talents, that is, its employees. After passing the selection process, it is essential to register the employee, whether hired as a CLT or a PJ, in a system that centralizes crucial information relating to their hiring, documentation control, personal data and other details. One of the primary considerations in this project was to ensure full compliance with the General Data Protection Law (LGPD), ensuring that access to information is restricted.",
        "api-3-title": "Cross-Selling System on UOL's Online Platform 3° Semester of 2022",
        "api-3-description": "UOL offers solutions that make people's daily lives easier. These solutions are mostly provided through an online platform, which is constantly evolving to enhance user experience. One evolution on the platform is Cross-Selling. It has been observed that encouraging cross-selling of other products within the checkout page can ensure that the customer purchases what they need in a single checkout, thereby aiding in increasing the business area's revenue. In partnership with Fatec São José dos Campos, we believe that 3rd DSM students can contribute with disruptive alternatives for cross-selling UOL products.",
        "api-4-title": "Weather Station System (IOT) 4° Semester of 2023",
        "api-4-description": "A weather station is a device that collects real-time weather data, including temperature, humidity, atmospheric pressure, wind direction and speed, solar radiation, and other parameters. The main goal is to collect this data through sensors installed in the station and send it to a cloud server via an internet connection. The collected data is made available to the station's users, allowing real-time monitoring of weather conditions in their region. Additionally, this data can be used in research in areas such as geography, environment, agriculture, and others, contributing to a better understanding of weather conditions and their impact on nature and society.",
        "api-5-title": "TaskManager (Oracle) - Efficiency System in Task and Objective Management 5° Semester of 2023",
        "api-5-description": "The challenge posed by the partner company, regarding the organization, prioritization of tasks, and daily assignments, both in personal routines and in the corporate world, our team aims to create an application that assists in organizing and planning objectives and their daily tasks, prioritizing them by urgency and with time markings for more precise control of both objectives and tasks, besides measuring the quantity of tasks performed and presenting monthly results of a particular user on a dashboard.",
        "api-6-title": "Automatic Customer Comment Summarization System with NLP 6° Semester of 2024",
        "api-6-description": "The goal of this project is to develop an innovative system that utilizes natural language processing (NLP) artificial intelligence (AI) to automatically summarize large volumes of customer comments. The system will generate concise and informative summaries, categorized by various relevant criteria for analysis, such as product, category, recommendation, geography, and demographics."
    }
}