{
    "translation": {
    "Sobre min":"Sobre min",
    "Home":"Inicio",
    "Projetos":"Projetos",
    "Contate-me":"Contate-me",
    "bemvindo":"Seja bem-vindo!, Eu sou",
    "algoincrivel":"Vamos fazer algo incrível juntos!",
    "currículo":"Currículo",
    "atualmente":"Atualmente trabalhando como",
    "desenvolvedor":"Desenvolvedor de software",
    "em":"em",
    "produzido":"Criado por",
    "fechar":"fechar",
    "detalhes":"Ver detalhes",
    "Ver":"Ver no",
    "sobretexto1":"Estou atualmente cursando o 6º semestre de Desenvolvimento de Software Multiplataforma na renomada Faculdade de Tecnologia do Estado de São Paulo (Fatec) Prof. Jessen Vidal. Sou apaixonado por ambientes de trabalho colaborativos, onde posso contribuir efetivamente em equipes voltadas para o desenvolvimento de novos projetos ou na otimização de sistemas existentes. Sou um estudante motivado, sempre em busca de aprimoramento e aprendizado contínuo. Meu objetivo principal é criar soluções tecnológicas robustas que agreguem valor significativo.",
    "sobretexto2":"Possuo habilidades técnicas em diversas linguagens de programação, incluindo Java, JavaScript,Python e Typescript assim como experiências academicas em frameworks como Spring,React,Vue,FastAPI e Node. Tenho experiência prática no desenvolvimento full-stack, utilizando React para a construção do frontend e implementando APIs REST para o backend. Além disso, possuo conhecimento em gerenciamento de banco de dados, com experiência em MySQL.",
    "habilidades":"Habilidades",
    "expyear":"ano de experiência",
    "expyears":"anos de experiência",
    "api-1-title":"Sistema de Divulgação de Informações Prioritárias da FATEC São José dos Campos",
    "api-1-description":"Devido o alto volume de informações trocadas via e-mail, devido a pandemia do covid-19, fazendo com que muitas informações importantes passassem a ser recebidas/lidas fora do seu tempo apropriado, diante desse cenário, faz-se necessário o desenvolvimento de uma aplicação capaz de divulgar de forma controlada e seletiva os avisos gerais ou específicos dos cursos da Fatec para docentes ou discentes.",
    "api-2-title":"Sistema de Gestão de Talentos para Recursos Humanos e Departamento Pessoal",
    "api-2-description":"Meu objetivo foi apoiar a área de Recursos Humanos e Departamento Pessoal no desenvolvimento de uma plataforma destinada a gerenciar com eficiência todos os talentos da empresa, ou seja, seus colaboradores. Após a aprovação no processo seletivo, é fundamental o cadastro do colaborador, seja ele contratado como CLT ou PJ, em um sistema que centraliza informações cruciais relativas à sua contratação, controle de documentação, dados pessoais e demais detalhes. Uma das considerações primordiais nesse projeto foi garantir total conformidade com a Lei Geral de Proteção de Dados (LGPD), assegurando que o acesso às informações seja restrito.",
    "api-3-title":"Sistema de Cross-Selling na Plataforma Online da UOL",
    "api-3-description":"A UOL oferece soluções que facilitam o dia a dia das pessoas. As soluções, em sua maioria, são ofertadas por um plataforma on-line, que está em constante evolução para melhorar a experiência do usuário. Uma das evoluções na plataforma é a Venda-Cruzada (Cross-Selling). Foi observado que incentivar o cross-selling de outros produtos dentro da página de compra, pode garantir que o cliente contrate o que precisa em um único checkout (acesso) e consequentemente auxilia no aumento de receita da área de negócio. Em parceria com a Fatec São José dos Campos acreditamos que alunos do 3º DSM podem contribuir com alternativas disruptivas de cross-selling de produtos UOL.",
    "api-4-title":"Sistema Estação meteorológica(IOT)",
    "api-4-description":"Uma stação meteorológica é um dispositivo que coleta dados meteorológicos em tempo real, incluindo temperatura, umidade, pressão atmosférica, direção e velocidade do vento, radiação solar e outros parâmetros. O objetivo principal é coletar esses dados por meio de sensores instalados na estação e enviá-los para um servidor na nuvem por meio de uma conexão com a internet. Os dados coletados são disponibilizados para os usuários da estação, permitindo o monitoramento das condições climáticas em tempo real em sua região. Além disso, esses dados podem ser usados em pesquisas em áreas como geografia, meio ambiente, agricultura e outros, contribuindo para uma melhor compreensão das condições climáticas e seu impacto na natureza e na sociedade.",
    "api-5-title":"TaskManager(Oracle)-Sistema de Eficiência na Gestão de Tarefas e Objetivos",
    "api-5-description":"o desafio proposto pela empresa parceira, referente a organização, priorização de tarefas e atribuições diárias, tanto na rotina pessoal quanto no mundo corporativo, nossa equipe tem como objetivo a criação de uma aplicação que auxilie na organização e no planejamentos de objetivos e suas tarefas diárias, priorizando-as por urgência e com marcações de tempo para um controle mais preciso tanto dos objetivos quanto das tarefas, além da mensuaração da quantidade de tarefas realizadas e apresentação mensal de resultados de determinado usuário em um dashboard.",
    "api-6-title":"Sistema de Sumarização Automática de Comentários de Clientes com PLN",
    "api-6-description":"O objetivo deste projeto é desenvolver um sistema inovador que utiliza inteligência artificial (IA) em linguagem natural para sumarizar automaticamente grandes volumes de comentários de clientes. O sistema irá gerar resumos concisos e informativos, categorizados por diversos critérios relevantes para análise, como produto, categoria, recomendação, geografia e demografia."
    }
}